# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MullionTypeSet..::..Contains Method
MullionTypeSet Class See Also
---
Tests for the existence of a mullion type within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	MullionType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As MullionType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	MullionType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..MullionTypeThe mullion type to be searched for.
# ### Return Value
The Contains method returns True if the mullion type is within the set, otherwise False.
# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace